In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('Titanic.csv')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,outliercalId,outlier
0,0,3,male,22,1,0,7.2500,S,Third,man,True,C,Southampton,no,False,3,NaN
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,NaN
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True,3,NaN
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,NaN
4,0,3,male,35,0,0,8.0500,S,Third,man,True,C,Southampton,no,True,3,NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 17 columns):
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             891 non-null int64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        891 non-null object
class           891 non-null object
who             891 non-null object
adult_male      891 non-null bool
deck            891 non-null object
embark_town     891 non-null object
alive           891 non-null object
alone           891 non-null bool
outliercalId    891 non-null int64
outlier         0 non-null float64
dtypes: bool(2), float64(2), int64(6), object(7)
memory usage: 106.2+ KB

In [10]:
type(int(df['age'].min()))

int